DataProcessors/РаботаСРегистрами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>РаботаСРегистрами</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ИтогиПоДокументам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ИтогиПоДокументам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиНаСкладе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНаСкладе</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склады</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПоступлениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИтогиПоДокументам</xr:Item>
				<xr:Item>AccumulationRegister.Закупки</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>InformationRegister.ЦеныПоступления</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиНаСкладе</xr:Item>
				<xr:Item>AccountingRegister.РегистрУправленческий</xr:Item>
				<xr:Item>AccountingRegister.Хозяйственный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоровыеТочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПоступления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пояснение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РеализацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РеализацияТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
				<xr:Item>Document.РезервыТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Резервы</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиПроцентОтПродажиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ИтогиПоДокументам</xr:Item>
				<xr:Item>AccumulationRegister.СобранныеСБ</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиНаСкладе</xr:Item>
				<xr:Item>AccountingRegister.РегистрУправленческий</xr:Item>
				<xr:Item>AccountingRegister.Хозяйственный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоровыеТочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезервыТоваров</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РезервыТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/РаботаСРегистрами/Forms/Форма/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура ПросмотрСтруктурыБазыНаСервере()
	ТаблицаСтруктурыБазы= ПолучитьСтруктуруХраненияБазыДанных();
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрСтруктурыБазы(Команда)
	ПросмотрСтруктурыБазыНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПересчитатьИтогиПоРегиструНаСервере()
	РегистрыНакопления.ОстаткиТоваров.ПересчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогиПоРегистру(Команда)
	ПересчитатьИтогиПоРегиструНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроведениеВМодулеДокументаНаСервере()
	ТекДокОбъект = ПоступлениеТоваровИУслуг.ПолучитьОбъект();
	ТекДокОбъект.ПроведениеВМодуле();
КонецПроцедуры

&НаКлиенте
Процедура ПроведениеВМодулеДокумента(Команда)
	ПроведениеВМодулеДокументаНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьДокументыНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровИУслуг.Ссылка КАК Ссылка,
	|	ПоступлениеТоваровИУслуг.Проведен КАК Проведен
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваровИУслуг
	|ГДЕ
	|	ПоступлениеТоваровИУслуг.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекОбъект =  ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если ВыборкаДетальныеЗаписи.Проведен Тогда
			ТекОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			
			ТекОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли; 
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализационнаяНакладная.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализационнаяНакладная
	|ГДЕ
	|	РеализационнаяНакладная.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекОбъект =  ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ТекОбъект.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЦикла;
	
	
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЗаписатьКурсНаСервере(НаДату,Валюта,Курс)
	ЗаписьРегистра = РегистрыСведений.Курсы.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Период=НаДату;
	ЗаписьРегистра.Валюта=Валюта;
	ЗаписьРегистра.Курс=Курс;
	ЗаписьРегистра.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКурс(Команда)
	ЗаписатьКурсНаСервере(НаДату,Валюта,Курс);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоказатьКурсНаСервере(НаДату)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КурсыСрезПоследних.Период,
	|	КурсыСрезПоследних.Валюта,
	|	КурсыСрезПоследних.Курс
	|ИЗ
	|	РегистрСведений.Курсы.СрезПоследних(&НаДату, ) КАК КурсыСрезПоследних";
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сообщить(ВыборкаДетальныеЗаписи.курс);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКурс(Команда)
	ПоказатьКурсНаСервере(НаДату);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыборПоРегистраторуНаСервере(ТекДокумент)
	Выборка= РегистрыНакопления.ОстаткиТоваров.ВыбратьПоРегистратору(ТекДокумент);
	Пока Выборка.Следующий() Цикл
		
		Сообщить(Выборка.Товар);
		
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПоРегистратору(Команда)
	ВыборПоРегистраторуНаСервере(ПоступлениеТоваровИУслуг);
КонецПроцедуры



&НаКлиенте
Процедура ЗаписатьДокументы(Команда)
	ЗаписатьДокументыНаСервере();
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ПереформироватьДвиженияНаСервере(Склад)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровИУслуг.Ссылка КАК Ссылка,
	|	ПоступлениеТоваровИУслуг.Дата КАК Дата,
	|	ПоступлениеТоваровИУслуг.Поставщик КАК Поставщик,
	|	ПоступлениеТоваровИУслуг.Организация КАК Организация,
	|	ПоступлениеТоваровИУслуг.Склад КАК Склад
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваровИУслуг
	|ГДЕ
	|	ПоступлениеТоваровИУслуг.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекОбъект =  ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Движения =ТекОбъект.Движения;
		Движения.ИтогиПоДокументам.Записывать=Истина;
		Движение = Движения.ИтогиПоДокументам.Добавить();
		Движение.Период = ВыборкаДетальныеЗаписи.Дата;
		Движение.Сумма = ТекОбъект.Товары.Итог("Сумма")+ ТекОбъект.Услуги.Итог("Сумма");
		Движение.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
		Движение.Автор = ПараметрыСеанса.ТекущийПользователь;
		Движения.ИтогиПоДокументам.Записать();
		Для Каждого ТекСтрокаТовары Из ТекОбъект.Товары Цикл
			Движение = Движения.ОстаткиНаСкладе.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ВыборкаДетальныеЗаписи.Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Характеристика = ТекСтрокаТовары.Характеристика;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.Склад = ТекОбъект.Склад;			
		КонецЦикла;	
		Движения.ОстаткиТоваров.Записать();
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализационнаяНакладная.Ссылка,
	|	РеализационнаяНакладная.Дата,
	|	РеализационнаяНакладная.Покупатель,
	|	РеализационнаяНакладная.Организация,
	|	РеализационнаяНакладная.Склад КАК Склад
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализационнаяНакладная
	|ГДЕ
	|	РеализационнаяНакладная.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекОбъект =  ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если Не ЗначениеЗаполнено(ТекОбъект.Склад) Тогда
			ТекОбъект.Склад = Склад;
			ТекОбъект.Записать();
			
		КонецЕсли; 
		Движения =ТекОбъект.Движения;
		Движения.ИтогиПоДокументам.Записывать=Истина;
		Движение = Движения.ИтогиПоДокументам.Добавить();
		Движение.Период = ВыборкаДетальныеЗаписи.Дата;
		Движение.Сумма = ТекОбъект.Товары.Итог("Сумма");
		Движение.Контрагент = ВыборкаДетальныеЗаписи.Покупатель;
		Движение.Автор = ПараметрыСеанса.ТекущийПользователь;
		Движения.ИтогиПоДокументам.Записать();
		Для Каждого ТекСтрокаТовары Из ТекОбъект.Товары Цикл
			Движение = Движения.ОстаткиНаСкладе.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ВыборкаДетальныеЗаписи.Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение. Характеристика= ТекСтрокаТовары.Характеристика ;
			Движение.Склад = ТекОбъект.Склад;
			Движение.Количество = ТекСтрокаТовары.Количество;  
		КонецЦикла;	
		Движения.ОстаткиТоваров.Записать();
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Счет.Ссылка,
	|	Счет.Дата,
	|	Счет.Контрагент,
	|	Счет.Организация,
	|	Счет.Автор
	|ИЗ
	|	Документ.Счет КАК Счет
	|ГДЕ
	|	Счет.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекОбъект =  ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Движения =ТекОбъект.Движения;
		Движения.ИтогиПоДокументам.Записывать=Истина;
		Движение = Движения.ИтогиПоДокументам.Добавить();
		Движение.Период = ВыборкаДетальныеЗаписи.Дата;
		Движение.Сумма = ТекОбъект.Товары.Итог("Сумма");
		Движение.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
		Движение.Автор = ТекОбъект.Автор;
		Движения.ИтогиПоДокументам.Записать();
		
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Возврат.Ссылка,
	|	Возврат.Дата,
	|	Возврат.Контрагент,
	|	Возврат.Организация,
	|	Возврат.Автор
	|ИЗ
	|	Документ.Возврат КАК Возврат
	|ГДЕ
	|	Возврат.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекОбъект =  ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если Не ЗначениеЗаполнено(ТекОбъект.Склад) Тогда
			ТекОбъект.Склад = Склад;
			ТекОбъект.Записать();
			
		КонецЕсли; 
		Движения =ТекОбъект.Движения;
		Движения.ИтогиПоДокументам.Записывать=Истина;
		Движение = Движения.ИтогиПоДокументам.Добавить();
		Движение.Период = ВыборкаДетальныеЗаписи.Дата;
		Движение.Сумма = ТекОбъект.Товары.Итог("Сумма");
		Движение.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
		Движение.Автор = ТекОбъект.Автор;
		Движения.ИтогиПоДокументам.Записать();
		Для Каждого ТекСтрокаТовары Из ТекОбъект.Товары Цикл
			Движение = Движения.ОстаткиТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ВыборкаДетальныеЗаписи.Дата;
			Движение.Товар = ТекСтрокаТовары.Товар;
			Движение.Организация = ВыборкаДетальныеЗаписи.Организация;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.Сумма = ТекСтрокаТовары.Сумма;
			Движение.Склад = ТекОбъект.Склад;
			Движение.Поставщик = ВыборкаДетальныеЗаписи.Контрагент;
			
		КонецЦикла;	
		Движения.ОстаткиТоваров.Записать();
		
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ПереформироватьДвижения(Команда)
	ПереформироватьДвиженияНаСервере(Склад);
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ВсеОстаткиНаСервере()
	ТаблицаОстатков = РегистрыНакопления.ОстаткиНаСкладе.Остатки();	
	
КонецПроцедуры


&НаКлиенте
Процедура ВсеОстатки(Команда)
	ВсеОстаткиНаСервере();
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ВыбратьВсеДанныеНаСервере()
	Выборка = РегистрыНакопления.ОстаткиТоваров.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Сообщить(Выборка.Товар);
		
	КонецЦикла; 
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеДанные(Команда)
	ВыбратьВсеДанныеНаСервере();
КонецПроцедуры
